#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/calavia-org/s3-website/runs/run-vMXtExyGANhButUA

Waiting for the plan to start...

Terraform v1.1.7
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_acm_certificate.ssl_certificate will be created
  + resource "aws_acm_certificate" "ssl_certificate" {
      + arn                       = (known after apply)
      + domain_name               = "shutappcar.calavia.org"
      + domain_validation_options = (known after apply)
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "www.shutappcar.calavia.org",
        ]
      + tags                      = {
          + "Terraform" = "true"
        }
      + tags_all                  = {
          + "Terraform" = "true"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "EMAIL"
    }

  # aws_acm_certificate_validation.cert_validation will be created
  + resource "aws_acm_certificate_validation" "cert_validation" {
      + certificate_arn = (known after apply)
      + id              = (known after apply)
    }

  # aws_kms_key.app_key will be created
  + resource "aws_kms_key" "app_key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "This key is used to encrypt buckets"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags                               = {
          + "Terraform" = "true"
        }
      + tags_all                           = {
          + "Terraform" = "true"
        }
    }

  # module.s3_log_bucket.aws_s3_bucket.bucket will be created
  + resource "aws_s3_bucket" "bucket" {
      + acceleration_status                  = (known after apply)
      + acl                                  = (known after apply)
      + arn                                  = (known after apply)
      + bucket                               = "log.shutappcar.calavia.org"
      + bucket_domain_name                   = (known after apply)
      + bucket_regional_domain_name          = (known after apply)
      + cors_rule                            = (known after apply)
      + force_destroy                        = false
      + grant                                = (known after apply)
      + hosted_zone_id                       = (known after apply)
      + id                                   = (known after apply)
      + lifecycle_rule                       = (known after apply)
      + logging                              = (known after apply)
      + policy                               = (known after apply)
      + region                               = (known after apply)
      + replication_configuration            = (known after apply)
      + request_payer                        = (known after apply)
      + server_side_encryption_configuration = (known after apply)
      + tags                                 = {
          + "Site"      = "shutappcar.calavia.org"
          + "Terraform" = "true"
        }
      + tags_all                             = {
          + "Site"      = "shutappcar.calavia.org"
          + "Terraform" = "true"
        }
      + versioning                           = (known after apply)
      + website                              = (known after apply)
      + website_domain                       = (known after apply)
      + website_endpoint                     = (known after apply)

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)
          + rule                = (known after apply)
        }
    }

  # module.s3_log_bucket.aws_s3_bucket_acl.bucket will be created
  + resource "aws_s3_bucket_acl" "bucket" {
      + acl    = "log-delivery-write"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # module.s3_log_bucket.aws_s3_bucket_public_access_block.bucket will be created
  + resource "aws_s3_bucket_public_access_block" "bucket" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.s3_log_bucket.aws_s3_bucket_server_side_encryption_configuration.bucket will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "bucket" {
      + bucket = "log.shutappcar.calavia.org"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = (known after apply)
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.s3_log_bucket.aws_s3_bucket_versioning.bucket will be created
  + resource "aws_s3_bucket_versioning" "bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.s3_root_bucket.aws_s3_bucket.bucket will be created
  + resource "aws_s3_bucket" "bucket" {
      + acceleration_status                  = (known after apply)
      + acl                                  = (known after apply)
      + arn                                  = (known after apply)
      + bucket                               = "shutappcar.calavia.org"
      + bucket_domain_name                   = (known after apply)
      + bucket_regional_domain_name          = (known after apply)
      + cors_rule                            = (known after apply)
      + force_destroy                        = false
      + grant                                = (known after apply)
      + hosted_zone_id                       = (known after apply)
      + id                                   = (known after apply)
      + lifecycle_rule                       = (known after apply)
      + logging                              = (known after apply)
      + policy                               = (known after apply)
      + region                               = (known after apply)
      + replication_configuration            = (known after apply)
      + request_payer                        = (known after apply)
      + server_side_encryption_configuration = (known after apply)
      + tags                                 = {
          + "Site"      = "shutappcar.calavia.org"
          + "Terraform" = "true"
        }
      + tags_all                             = {
          + "Site"      = "shutappcar.calavia.org"
          + "Terraform" = "true"
        }
      + versioning                           = (known after apply)
      + website                              = (known after apply)
      + website_domain                       = (known after apply)
      + website_endpoint                     = (known after apply)

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)
          + rule                = (known after apply)
        }
    }

  # module.s3_root_bucket.aws_s3_bucket_acl.bucket will be created
  + resource "aws_s3_bucket_acl" "bucket" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # module.s3_root_bucket.aws_s3_bucket_public_access_block.bucket will be created
  + resource "aws_s3_bucket_public_access_block" "bucket" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.s3_root_bucket.aws_s3_bucket_server_side_encryption_configuration.bucket will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "bucket" {
      + bucket = "shutappcar.calavia.org"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = (known after apply)
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.s3_root_bucket.aws_s3_bucket_versioning.bucket will be created
  + resource "aws_s3_bucket_versioning" "bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.s3_root_website_config.aws_s3_bucket_website_configuration.redirect_bucket[0] will be created
  + resource "aws_s3_bucket_website_configuration" "redirect_bucket" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + redirect_all_requests_to {
          + host_name = "www.shutappcar.calavia.org"
          + protocol  = "https"
        }
    }

  # module.s3_www_bucket.aws_s3_bucket.bucket will be created
  + resource "aws_s3_bucket" "bucket" {
      + acceleration_status                  = (known after apply)
      + acl                                  = (known after apply)
      + arn                                  = (known after apply)
      + bucket                               = "www.shutappcar.calavia.org"
      + bucket_domain_name                   = (known after apply)
      + bucket_regional_domain_name          = (known after apply)
      + cors_rule                            = (known after apply)
      + force_destroy                        = false
      + grant                                = (known after apply)
      + hosted_zone_id                       = (known after apply)
      + id                                   = (known after apply)
      + lifecycle_rule                       = (known after apply)
      + logging                              = (known after apply)
      + policy                               = (known after apply)
      + region                               = (known after apply)
      + replication_configuration            = (known after apply)
      + request_payer                        = (known after apply)
      + server_side_encryption_configuration = (known after apply)
      + tags                                 = {
          + "Site"      = "shutappcar.calavia.org"
          + "Terraform" = "true"
        }
      + tags_all                             = {
          + "Site"      = "shutappcar.calavia.org"
          + "Terraform" = "true"
        }
      + versioning                           = (known after apply)
      + website                              = (known after apply)
      + website_domain                       = (known after apply)
      + website_endpoint                     = (known after apply)

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)
          + rule                = (known after apply)
        }
    }

  # module.s3_www_bucket.aws_s3_bucket_acl.bucket will be created
  + resource "aws_s3_bucket_acl" "bucket" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # module.s3_www_bucket.aws_s3_bucket_public_access_block.bucket will be created
  + resource "aws_s3_bucket_public_access_block" "bucket" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.s3_www_bucket.aws_s3_bucket_server_side_encryption_configuration.bucket will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "bucket" {
      + bucket = "www.shutappcar.calavia.org"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = (known after apply)
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.s3_www_bucket.aws_s3_bucket_versioning.bucket will be created
  + resource "aws_s3_bucket_versioning" "bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.s3_www_website_config.aws_s3_bucket_cors_configuration.bucket[0] will be created
  + resource "aws_s3_bucket_cors_configuration" "bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + cors_rule {
          + allowed_headers = [
              + "Authorization",
              + "Content-Length",
            ]
          + allowed_methods = [
              + "GET",
            ]
          + allowed_origins = [
              + "https://www.shutappcar.calavia.org",
            ]
          + expose_headers  = []
          + max_age_seconds = 3000
        }
    }

  # module.s3_www_website_config.aws_s3_bucket_website_configuration.bucket[0] will be created
  + resource "aws_s3_bucket_website_configuration" "bucket" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "error.html"
        }

      + index_document {
          + suffix = "index.html"
        }
    }

Plan: 21 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "kms_key" but a value was
│ found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

</details>

*Pusher: @jcalavia, Action: `pull_request`*